# 1. Найти сумму чисел списка стоящих на нечетной позиции

list = [1, 9, 7, 8, 4, 2, 1, 3, 7, 4]
sum = 0
for i in range(0, len(list), 2):
    sum += list[i]
    
print(f'Сумма чисел нечетных позиций: {sum}')
