#Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

list = [3,12,17,111,15,95]
max_number = max(list)
print("Наибольшее число:", max_number)